In [1]:
people = { "first" : ['nisheet','rohan','amit','abhi','priyanshu','shlok'],
            "last" : ['patel', 'soni', 'soni', 'patel','patel','bhavsar'],
          "email" : ["nisheet@gmail.com", "rohansoni@gmail.com","amitsoni@gmail.com","abhi@gmail.com",'priyanshu@gmail.com','sb22@gmail.com']
         }

In [2]:
import pandas as pd
df = pd.DataFrame(people)

## Changing Columns

In [3]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [4]:
df.columns = ['first_name','last_name','email']

In [5]:
df

  first_name last_name                email
0    nisheet     patel    nisheet@gmail.com
1      rohan      soni  rohansoni@gmail.com
2       amit      soni   amitsoni@gmail.com
3       abhi     patel       abhi@gmail.com
4  priyanshu     patel  priyanshu@gmail.com
5      shlok   bhavsar       sb22@gmail.com

In [6]:
df.columns = [x.upper() for x in df.columns]

In [7]:
df

  FIRST_NAME LAST_NAME                EMAIL
0    nisheet     patel    nisheet@gmail.com
1      rohan      soni  rohansoni@gmail.com
2       amit      soni   amitsoni@gmail.com
3       abhi     patel       abhi@gmail.com
4  priyanshu     patel  priyanshu@gmail.com
5      shlok   bhavsar       sb22@gmail.com

In [8]:
df.columns = df.columns.str.replace('_',' ')

In [9]:
df

  FIRST NAME LAST NAME                EMAIL
0    nisheet     patel    nisheet@gmail.com
1      rohan      soni  rohansoni@gmail.com
2       amit      soni   amitsoni@gmail.com
3       abhi     patel       abhi@gmail.com
4  priyanshu     patel  priyanshu@gmail.com
5      shlok   bhavsar       sb22@gmail.com

In [10]:
# undo
df.columns = [x.lower() for x in df.columns]
df.columns = df.columns.str.replace(' ','_')

In [11]:
df

  first_name last_name                email
0    nisheet     patel    nisheet@gmail.com
1      rohan      soni  rohansoni@gmail.com
2       amit      soni   amitsoni@gmail.com
3       abhi     patel       abhi@gmail.com
4  priyanshu     patel  priyanshu@gmail.com
5      shlok   bhavsar       sb22@gmail.com

## .rename()

In [12]:
df.rename(columns={'first_name' : 'first',"last_name" : "last"}, inplace=True)

In [13]:
df

       first     last                email
0    nisheet    patel    nisheet@gmail.com
1      rohan     soni  rohansoni@gmail.com
2       amit     soni   amitsoni@gmail.com
3       abhi    patel       abhi@gmail.com
4  priyanshu    patel  priyanshu@gmail.com
5      shlok  bhavsar       sb22@gmail.com

## Value Change

In [14]:
df.loc[5,'email'] = "shlok22@gmail.com"

In [15]:
df.loc[1,['last','email']] = ['sharma',"rohan32@gmail.com"]

In [16]:
df.at[2, 'email'] = "amilsoni2@gmail.com"

In [17]:
df

       first     last                email
0    nisheet    patel    nisheet@gmail.com
1      rohan   sharma    rohan32@gmail.com
2       amit     soni  amilsoni2@gmail.com
3       abhi    patel       abhi@gmail.com
4  priyanshu    patel  priyanshu@gmail.com
5      shlok  bhavsar    shlok22@gmail.com

## .apply()

In [18]:
df['email'].apply(len)

0    17
1    17
2    19
3    14
4    19
5    17
Name: email, dtype: int64

In [19]:
def upper_email(email):
    return email.upper()

In [20]:
# we can also use lambda functions
df['email'].apply(upper_email)

0      NISHEET@GMAIL.COM
1      ROHAN32@GMAIL.COM
2    AMILSONI2@GMAIL.COM
3         ABHI@GMAIL.COM
4    PRIYANSHU@GMAIL.COM
5      SHLOK22@GMAIL.COM
Name: email, dtype: object

In [21]:
# to update in DataFrame
df['email'] = df['email'].apply(upper_email)

In [22]:
df.apply(len)

first    6
last     6
email    6
dtype: int64

In [23]:
# change axis
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
4    3
5    3
dtype: int64

In [24]:
# get min value
df.apply(pd.Series.min)
# we can do like this also -> df.apply(lambda x: x.min())

first              abhi
last            bhavsar
email    ABHI@GMAIL.COM
dtype: object

## .applymap()

In [25]:
df.applymap(len)

   first  last  email
0      7     5     17
1      5     6     17
2      4     4     19
3      4     5     14
4      9     5     19
5      5     7     17

In [26]:
 df.applymap(str.lower)

       first     last                email
0    nisheet    patel    nisheet@gmail.com
1      rohan   sharma    rohan32@gmail.com
2       amit     soni  amilsoni2@gmail.com
3       abhi    patel       abhi@gmail.com
4  priyanshu    patel  priyanshu@gmail.com
5      shlok  bhavsar    shlok22@gmail.com

## .map()
Its only work on series

In [27]:
df['first'].map({'priyanshu' : "CrazyPSP", 'amit' : 'Amit'})
# Instead of using map we can use .replace()

0         NaN
1         NaN
2        Amit
3         NaN
4    CrazyPSP
5         NaN
Name: first, dtype: object

In [29]:
df['first'].replace({'priyanshu' : "CrazyPSP", 'amit' : 'Amit'})
# to apply change in DataFram
# df['first'] = df['first'].replace({'priyanshu' : "CrazyPSP", 'amit' : 'Amit'})

0     nisheet
1       rohan
2        Amit
3        abhi
4    CrazyPSP
5       shlok
Name: first, dtype: object